notes/meeting_2022sep25.org
* meeting notes September 25, 2022
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022sep25.md
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/sep25
** topics 
*** substr uses first_position and length
**** but I always want ranges: first_position, second_position
**** how would you raku that?

*** revisit: "eurorack": william michels interested in synthesized music 
**** https://www.modulargrid.net/e/modules/evaluationlists



** announcements 
*** October 9th: the next raku study group meeting
*** My Bali vacation pics, cleaned up further:
**** http://obsidianrook.com/pics/bali2022
