notes/meeting_2022sep25.md
- [meeting notes September 25, 2022](#orgba18757)
  - [the raku study group](#orge3d564e)
  - [topics](#org4446cab)
    - [substr uses first<sub>position</sub> and length](#org1c25e19)
    - [revisit: "eurorack": william michels interested in synthesized music](#orge469181)
  - [announcements](#orgb0ce9f2)
    - [October 9th: the next raku study group meeting](#org8b5e2cb)
    - [My Bali vacation pics, cleaned up further:](#orgd0c3123)


<a id="orgba18757"></a>

# meeting notes September 25, 2022


<a id="orge3d564e"></a>

## the raku study group

1.  usual links

    1.  these notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022sep25.md>
    
    2.  code examples
    
        1.  <https://github.com/doomvox/raku-study/tree/main/bin/sep25>


<a id="org4446cab"></a>

## topics


<a id="org1c25e19"></a>

### substr uses first<sub>position</sub> and length

1.  but I always want ranges: first<sub>position</sub>, second<sub>position</sub>

2.  how would you raku that?


<a id="orge469181"></a>

### revisit: "eurorack": william michels interested in synthesized music

1.  <https://www.modulargrid.net/e/modules/evaluationlists>


<a id="orgb0ce9f2"></a>

## announcements


<a id="org8b5e2cb"></a>

### October 9th: the next raku study group meeting


<a id="orgd0c3123"></a>

### My Bali vacation pics, cleaned up further:

1.  <http://obsidianrook.com/pics/bali2022>
